let questions = [
    {
        numb:1,
        question:"SO<sub>3</sub> কোন ধরনের অক্সাইড?",
        answer:"ক) অম্লধর্মী অক্সাইড",
        options:[
            "ক) অম্লধর্মী অক্সাইড",
            "খ) ক্ষারধর্মী অক্সাইড",
            "গ) উভধর্মী অক্সাইড",
            "ঘ) নিরপেক্ষ অক্সাইড"
        ]
    },
    {
        numb: 2,
        question: "ক্ষারীয় পটাশিয়াম টেট্রা আয়োডা মারকিউরেট দ্রবণ দ্বারা নিচের কোনটি শনাক্ত করা হয়?",
        answer: "গ) NH₄⁺",
        options: [
			"ক) Al<sup>3+</sup>",
			"খ) Cu<sup>2+</sup>",
			"গ) NH₄⁺",
			"ঘ) CO<sub>3</sub><sup>2-</sup>",
        ]
      },
      {
        numb: 3,
        question: "ইলেকট্রন আসক্তি যে সকল নিয়ামক দ্বারা প্রভাবিত হয়—<br>i. পারমাণবিক ভর<br>ii. পরমাণুর আকার<br>iii. কার্যকর নিউক্লিয়ার আধান",
        answer: "গ) ii ও iii",
        options: [
          "ক) i ও ii",
          "খ) i ও iii",
          "গ) ii ও iii",
          "ঘ) i, ii ও ii"
        ]
      },
    
      {
        numb: 4,
        question: "ব্রাকেট সিরিজের ক্ষেত্রে N<sub>2</sub> এর মান কত?",
        answer: "ঘ) ৫",
        options: [
          "ক) ২",
          "খ) ৩",
          "গ) ৪",
          "ঘ) ৫"
        ]
      },
	  {
        numb: 5,
        question: "কোন বিক্রিয়াটির K<sub>c</sub> এর একক mol<sup>-1</sup>L?",
        answer: "গ) 2NO + O₂⇌2NO₂",
        options: [
          "ক) N<sub>2</sub>O<sub>4</sub>⇌2NO<sub>2</sub>",
          "খ) 2NH<sub>3</sub>⇌N<sub>2</sub> + 3H<sub>2</sub>",
          "গ) 2NO + O₂⇌2NO₂",
          "ঘ) N<sub>2</sub> + 3H<sub>2</sub>⇌2NH<sub>3</sub>"
        ]
      },
	  {
        numb: 6,
        question: "Image Error<br>A মৌলের শেষ কক্ষপথে কয়টি স্পিন কোয়ান্টাম সংখ্যা থাকে?",
        answer: "ক) 1",
        options: [
          "ক) 1",
          "খ) 2",
          "গ) 16",
          "ঘ) 32"
        ]
      },
	  {
        numb: 7,
        question: "Image Error<br>সারণির X, Y ও Z মৌল তিনটি—<br>i. মৃৎক্ষার ধাতু।<br>ii. s-ব্লক মৌল<br>iii. প্রতিনিধি মৌল",
        answer: "ঘ) i, ii ও ii",
        options: [
          "ক) i ও ii",
          "খ) i ও iii",
          "গ) ii ও iii",
          "ঘ) i, ii ও ii"
        ]
      },
	  {
        numb: 8,
        question: "প্রাকৃতিক অ্যান্টি অক্সিডেন্ট কোনটি?",
        answer: "ক) বিটা ক্যারোটিন",
        options: [
          "ক) বিটা ক্যারোটিন",
          "খ) ভিনেগার",
          "গ) BHT",
          "ঘ) BHA"
        ]
      },
	  {
        numb: 9,
        question: "X<sub>2</sub> + Y<sub>2</sub> ⇌ 2XY; বিক্রিয়াটির ক্ষেত্রে কোনটি প্রযোজ্য?",
        answer: "খ) Kp = Kc",
        options: [
          "ক) Kp > Kc",
          "খ) Kp = Kc",
          "গ) Kp < Kc",
          "ঘ) Kp ≠ Kc"
        ]
      },
	  {
        numb: 10,
        question: "H<sub>2</sub>S অনুর বন্ধন কোণ কত?",
        answer: "গ) 92°",
        options: [
          "ক) 109°",
          "খ) 107°",
          "গ) 92°",
          "ঘ) 72°"
        ]
      },
	  {
        numb: 11,
        question: "Image Error<br>কেন্দ্রীয় মৌলটির পর্যায় সারণিতে অবস্থান—",
        answer: "খ) তৃতীয় পর্যায়ের 15 নং গ্রুপে",
        options: [
          "ক) দ্বিতীয় পর্যায়ের 14 নং গ্রুপে",
          "খ) তৃতীয় পর্যায়ের 15 নং গ্রুপে",
          "গ) তৃতীয় পর্যায়ের 16 নং গ্রুপে",
          "ঘ) চতুর্থ পর্যায়ের 14 নং গ্রুপে"
        ]
      },
	  {
        numb: 12,
        question: "Image Error<br>চিত্র দুটির ক্ষেত্রে—<br>i. প্রথম চিত্রে sp<sup>2</sup> সংকরণ ঘটেছে<br>ii. দ্বিতীয় চিত্রে sp<sup>3</sup>d সংকরণ ঘটেছে<br>iii. প্রথম চিত্রের বন্ধন কোণের মান অভিন্ন হলেও দ্বিতীয় চিত্রের বন্ধন কোণের মান ভিন্ন",
        answer: "গ) ii ও iii",
        options: [
          "ক) i ও ii",
          "খ) i ও iii",
          "গ) ii ও iii",
          "ঘ) i, ii ও ii"
        ]
      },
	  {
        numb: 13,
        question: "রাদারফোর্ড নিউক্লিয়াস আবিষ্কার পরীক্ষায় ৯৯% আলফা (α) কণা স্বর্ণপাত ভেদ করে সোজা চলে যায় কেন?",
        answer: "",
        options: [
          "ক) পরমাণুর কেন্দ্র ধনাত্মক চার্জযুক্ত বলে",
          "খ) আলফা কণার গতিশক্তি বেশি বলে",
          "গ) আলফা কণার প্রতিফলিত হওয়ার ক্ষমতা কম",
          "ঘ) পরমাণুর অধিকাংশ স্থানই ফাঁকা"
        ]
      },
	  {
        numb: 14,
        question: "Image Error<br>চিত্রটির ক্ষেত্রে শক্তি বিকিরণের জন্য—<br>i. △E = E<sub>2</sub> – E<sub>1</sub><br>ii. △E = hυ<br>iii. △E = E<sub>1</sub> – E<sub>2</sub>",
        answer: "ক) i ও ii",
        options: [
          "ক) i ও ii",
          "খ) i ও iii",
          "গ) ii ও iii",
          "ঘ) i, ii ও ii"
        ]
      },
	  {
        numb: 15,
        question: "Cl পরমাণুর মুক্ত জোর ইলেকট্রন কত জোড়া?",
        answer: "ঘ) 3",
        options: [
          "ক) 0",
          "খ) 1",
          "গ) 2",
          "ঘ) 3"
        ]
      },
	  {
        numb: 16,
        question: "IR এর প্রভাবে ঘটে?",
        answer: "",
        options: [
          "ক) রক্ত সঞ্চালন হ্রাস",
          "খ) ধমনী ও শিরা প্রশস্তকরণ",
          "গ) অঙ্গ প্রতিস্থাপন",
          "ঘ) দেহের তাপমাত্রা হ্রাস"
        ]
      },
	  {
        numb: 17,
        question: "একটি উভমুখী বিক্রিয়া কীভাবে একমূখী করা যায়?<br>i. একটি উৎপাদ গ্যাসীয় হলে<br>ii. একটি উৎপাদ অধঃক্ষিপ্ত হলে<br>iii. একটি উৎপাদকে বিক্রিয়াস্থল থেকে সরিয়ে নিলে",
        answer: "ঘ) i, ii ও ii",
        options: [
          "ক) i ও ii",
          "খ) i ও iii",
          "গ) ii ও iii",
          "ঘ) i, ii ও ii"
        ]
      },
	  {
        numb: 18,
        question: "সিলভার ক্লোরাইডের দ্রাব্যতা প্রতি লিটার জলীয় দ্রবণে 0.00015 গ্রাম হলে দ্রাব্যতা গুণফল কত?",
        answer: "ক) 1.1×10-10",
        options: [
          "ক) 1.1×10<sup>-10</sup>",
          "খ) 1.1×10<sup>-12</sup>",
          "গ) 2.1×10<sup>-13</sup>",
          "ঘ) 2.1×10<sup>-15</sup>"
        ]
      },
	  {
        numb: 19,
        question: "Image Error<br>সাম্যবস্থায় নিচের কোনটি সঠিক?",
        answer: "ঘ) কখনো বিক্রিয়া সম্পূর্ণ হয় না",
        options: [
          "ক) প্রভাবকের প্রভাব আছে",
          "খ) পশ্চাদমুখী বিক্রিয়ার হার বেশি",
          "গ) সম্মুখমুখী বিক্রিয়ার হার বেশি",
          "ঘ) কখনো বিক্রিয়া সম্পূর্ণ হয় না"
        ]
      },
	  {
        numb: 20,
        question: "Image Error<br>সাম্যবস্থায় বিক্রিয়কের ঘনমাত্রা বৃদ্ধি করলে—<br>i. সাম্যবস্থার পরিবর্তন ঘটে<br>ii. সাম্যধ্রুবকের মানের কোন পরিবর্তন ঘটে না<br>iii. সাম্যাবস্থা ডান দিকে সরে যায়",
        answer: "ঘ) i, ii ও ii",
        options: [
          "ক) i ও ii",
          "খ) i ও iii",
          "গ) ii ও iii",
          "ঘ) i, ii ও ii"
        ]
      },
	  {
        numb: 21,
        question: "অ্যাসিটিলিনের অনুতে কোন বন্ধনসমূহ রয়েছে?",
        answer: "ক) 3σ, 2π",
        options: [
          "ক) 3σ, 2π",
          "খ) 1σ, 2π",
          "গ) 2σ, 1π",
          "ঘ) 1σ, 1π"
        ]
      },
	  {
        numb: 22,
        question: "অ্যাসিতোব্যাক্টর<br>A + O<sub>2</sub> → CH<sub>3</sub>COOH<br>বিক্রিয়াটিতে 'A' যৌগটি হলো—",
        answer: "খ) ইথানল",
        options: [
          "ক) মিথানল",
          "খ) ইথানল",
          "গ) মিথান্যাল",
          "ঘ) ইথান্যাল"
        ]
      },
	  {
        numb: 23,
        question: "সর্বপেক্ষা শক্তিশালী ক্ষার কোনটি?",
        answer: "গ) CsOH",
        options: [
          "ক) NaOH",
          "খ) KOH",
          "গ) CsOH",
          "ঘ) RbOH"
        ]
      },
	  {
        numb: 24,
        question: "3•5%Na2CO3 দ্রবণের P<sup>H</sup> কত?",
        answer: "ক) 13•8",
        options: [
          "ক) 13•8",
          "খ) 12•7",
          "গ) 11•5",
          "ঘ) 10•5"
        ]
      },
	  {
        numb: 25,
        question: "A<sub>2</sub> + B<sub>2</sub> ⇌ AB. বিক্রিয়াটির 25°C তাপমাত্রায় ও 1•5 atm চাপে Kp এর মান 5•6 হলে Kc এর মান কত?",
        answer: "খ) 5•6",
        options: [
          "ক) 7•5",
          "খ) 5•6",
          "গ) 3•6",
          "ঘ) 2•8"
        ]
      },
	  
]



function showResultBox(){
    RulesBox.classList.remove("activeInfo"); 
    Questions.classList.remove("activeQuiz"); 
    reslut_box.classList.add("activeResult");
    
    const scoreText = document.querySelector(".score_text"); 
    if(userScore > 19){//Change the good number
       let scoreTag = '<span>Congratulations You Got <p>'+ userScore +'</p> Out Of <p>'+questions.length +'</p></span>';
        scoreText.innerHTML = scoreTag; 
    }
   else if(userScore > 8){// Change The Pass Number
        let scoreTag = '<span>Carry On 👌 You Got <p>'+ userScore +'</p> Out Of <p>'+questions.length +'</p></span>';
         scoreText.innerHTML = scoreTag; 
     }
     else{
        let scoreTag ='<span> I Am  Sorry You Got <p>'+ userScore +'</p> Out Of <p>'+ questions.length +'</p></span>'; 
    
        scoreText.innerHTML = scoreTag;
    }
   
}